Repository: mgtf/pplib
Catalog: locale/*/LC_MESSAGES/pp_lib.po
Languages: fr

source: is not the name of an existing class
fr: n'est pas le nom d'une classe existante

source: you are trying to create an object from the class
fr: vous essayez de crer un objet de la classe

source: but it is already an object from the class
fr: vous essayez de crer un objet de la classe

source: file
fr: fichier

source: line
fr: ligne

source: error
fr: erreur

source: warning
fr: attention

source: does not exist
fr: n'existe pas

source: data or filename empty
fr: aucune donnes ou aucun nom fichier

source: already exist, use pp_file->write(1) to force overwrite
fr: existe dj; utilisez pp_file->write(1) pour forcer l'ecriture

source: directory
fr: rpertoire

source: is not writeable
fr: ne peut pas tre ecrit

source: can't open
fr: impossible de se connecter

source: can't write
fr: impossible de crer l'image

source: can't close
fr: impossible de se connecter

source: is not readable
fr: n'est pas autoris en lecture

source: can't get shared lock on file
fr: impossible de crer l'image

source: can't get exclusive lock on file
fr: impossible de crer l'image

source: can't unlock file
fr: impossible de crer l'image

source: you must specify at least one size
fr: vous devez spcifier au moins une taille

source: can't create temp image
fr: impossible de crer l'image

source: image is already a
fr: l'image est dj une

source: is not supported
fr: n'est pas support

source: has no extention
fr: n'a pas d'extention

source: can't create image from
fr: impossible de crer l'image

source: no image size
fr: pas de taille pour l'image

source: can't create image
fr: impossible de crer l'image

source: format is not supported
fr: n'est pas support

source: no subject
fr: pas de sujet

source: Missing parameters
fr: Paramtres manquants

source: can't add mime type
fr: impossible d'ajouter le type mime

source: this mime type is not supported
fr: Ce type mime n'est pas supporté

source: db access was not configured
fr: l'accs la base de donnes n'est pas configur

source: can't connect to
fr: impossible de se connecter

source: cannot use database
fr: impossible d'utiliser la base de donne

source: invalid sql
fr: requete sql invalide

source: next_record called with no query pending
fr: next_record appel sans requete

source: no output callback function defined
fr: aucune fonction de callback dfinie

source: function
fr: fonction

source: is not defined
fr: n'est pas dfini

source: arg is not an array
fr: arg n'est pas un tableau

source: no file to read
fr: pas de fichier lire

source: no file to write
fr: pas de fichier ou ecrire

source: no data to write
fr: pas de donnes ecrire

source: max iteration
fr: itration max

source: template error
fr: erreur de traitement du gabarit

source: you must specify template name
fr: vous devez spcifier au moins une taille

source: correct syntax is
fr: la syntaxe correct est

source: no such include file
fr: fichier à inclure invalide

source: invalid include file
fr: fichier inclure invalide

source: not set
fr: indefini

source: you must specify `bloc` arg in dynbloc tag
fr: vous devez spcifier l'argument 'bloc' dans un tag dynbloc

source: value
fr: valeur

source: please set
fr: veuillez spcifier

source: font file
fr: fichier de police

source: no text
fr: pas de texte

source: using both transparent background and antialiasing produce poor quality images !
fr: Utiliser un fond transparent ET le blur produit des images de pauvre qualit

source: Can't create XML parser
fr: impossible de crer un nouveau parseur XML

source: XML parse error
fr: XML erreur

source: this application is currently in a maintenance state
fr: Ce site est actuellement en état de maintenance

source: Please come back later
fr: Veuillez vous reconnecter ulterieurement

source: page generated on
fr: page générée en

source: Do you confirm modifications ?
fr: Souhaitez-vous vraiment sauvegarder les modifications ?

source: invert selection
fr: inverser la slection

source: Search
fr: Rechercher

source: into
fr: dans

source: displaying
fr: en affichant

source: elements per page
fr: lments par page

source: Sort by
fr: Classer par

source: order
fr: par ordre

source: ascendent
fr: croissant

source: descendent
fr: decroissant
